reddyp4/STM32/STM32G070/CubeIDE_Project/Src/main.c
// In M0, IOPORT, while in F4 it is clock access
// BTN=PC13, Bus=AHB1, RCC_IOPENR, bit 3
// LED=PA5, Bus=AHB1, RCC_IOPENR, bit 0
// ADC=PA0, GPIOA, Input
//#include "stm32g070xx.h"
#include "stm32g0xx_hal.h"
#include "uart.h"
#include "adc.h"
#include "exti.h"
#include "led.h"
#include "tim.h"
#include <stdio.h>
#include "spi.h"
#include "i2c.h"
#include "rtc.h"

#define BUTTON_AS_INTERRUPT     2   /* 0=Manual input, 1=interrupt, 2=no LED, PA5 for SPI */
#define UART_MODE               1   /* 0=polling, 1-interrupt, 2-dma */
#define ADC_CONTINUOUS_CONV     4   /* 0=Single Conversion, 1=Continuous conversion
                                       2=Interrupt Driven
                                       3=DMA 
                                       4=No ADC*/
#define SPI_MODE    2   /* 0-polling, 1-interrupt, 2-dma*/
#define I2C_PRESENT 0   /* if i2c device is present */
#define RTC_PRESENT 1   /* if rtc is present */
#define DMA_TO_DMA  1   /* 0-none, 1-memory-memory dma transfer, */

extern UART_HandleTypeDef huart2;
extern ADC_HandleTypeDef hadc1;
extern DMA_HandleTypeDef hdma_adc1;
extern SPI_HandleTypeDef hspi2;
extern I2C_HandleTypeDef hi2c1;
extern RTC_HandleTypeDef hrtc;

void pc13_btn_init(void);

int counter;
uint8_t buttonStatus;
char message[20] = "Hello from STM32\n";
uint32_t sensor_value_polled=0;
uint32_t sensor_value_conv=0;
uint32_t sensor_value_int=0;
uint32_t sensor_value_dma[1];
uint32_t sensor_SPI_polling=0;
uint32_t sensor_SPI_IT=0;
uint32_t sensor_SPI_dma=0;
uint32_t time_Main=0;       /* Time for each main loop */
/* SPI Buffer */
uint8_t tx_buffer[10]={10,20,30,40,50,60,70,80,90,100};
uint8_t rx_buffer[10];
/* I2C data */
extern uint8_t DATA_RECORD[6];
extern uint8_t device_id;
extern int16_t x,y,z;
extern float xg, yg, zg;

extern uint8_t time;
extern uint8_t date;

/* UART rx/tx buffer */
//uint8_t uart_tx_buffer, uart_rx_buffer;
/* Buffer to transfer via rx-tx loopback for interrupt */
uint8_t uart_tx_buffer[10]={11,21,31,41,51,61,71,81,91,101};
uint8_t uart_rx_buffer[10];
extern uint8_t uart_tx_counter, uart_rx_counter, uart_rx_tx_counter;


void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
    //ISR after tx/rx complete
    //do something
   //__HAL_SPI_ENABLE_IT(&hspi1, SPI_IT_RXNE);
   sensor_SPI_IT++;
   printf("Inside SPI Interrupt Callback!\n");
}

int main()
{
    HAL_Init(); //Initialize all HAL
    if(UART_MODE==0)
    {
        uart_init();       //USART initialization
    }
    else if(UART_MODE==1)
    {
        uart_interrupt_init();
        HAL_UART_Transmit_IT(&huart2,uart_tx_buffer,10);
        HAL_UART_Receive_IT(&huart2,uart_rx_buffer,10);
    }
    else
    {
        uart_dma_init();       //USART via dma initialization
        HAL_UART_Transmit_DMA(&huart2, uart_tx_buffer, 10);
        HAL_UART_Receive_DMA(&huart2, uart_rx_buffer, 10);
    }
    printf("Initiated UART!\n");

#if 0
    tim_timebase_init();

    /* Commented out for setting up as an interrupt driven LED */
    if(BUTTON_AS_INTERRUPT==0)
    {
        pa5_led_init(); //Initialize LED
        pc13_btn_init();    //Initialize Button*/
    }
    else if(BUTTON_AS_INTERRUPT==1)
    {
        gpio_pc13_interrupt_init();     // Interrupt based LED/GPIO
    }

    if(ADC_CONTINUOUS_CONV==0)
    {
        adc_single_conv_init(); //ADC Initialization
        HAL_ADC_Start(&hadc1);
    }
    if(ADC_CONTINUOUS_CONV==1)
        adc_init_start();     //ADC Initialization
    else if(ADC_CONTINUOUS_CONV==2)
    {
        adc_interrupt_init();   //ADC in interrupt mode
    }
    else if(ADC_CONTINUOUS_CONV==3)
    {
        adc_dma_init();   //ADC in dma mode
        HAL_ADC_Start_DMA(&hadc1,(uint32_t*)sensor_value_dma,1);  //Start the dma
    }
#endif

    /* Setup spi */
    printf("Before   SPI: %c, %c, %c, %c, %c, %c, %c, %c, %c, %c\n",rx_buffer[0],rx_buffer[1],rx_buffer[2],rx_buffer[3],rx_buffer[4],rx_buffer[5],rx_buffer[6],rx_buffer[7],rx_buffer[8],rx_buffer[9]);
    if(SPI_MODE==0)
    {
        printf("SPI in polling mode\n");
        spi_init();
        HAL_SPI_TransmitReceive(&hspi2,tx_buffer,rx_buffer,10,1000);
        sensor_SPI_polling++;
    }
    else if (SPI_MODE==1)
    {
        printf("SPI in interrupt mode\n");
        spi_interrupt_init();
        HAL_SPI_TransmitReceive_IT(&hspi2,tx_buffer,rx_buffer,10);
    }
    else if(SPI_MODE==2)
    {
        sensor_SPI_dma++;
        printf("SPI in dma mode\n");
        spi_dma_init();
        HAL_SPI_TransmitReceive_DMA(&hspi2,tx_buffer,rx_buffer,10);
    }
    printf("Finished SPI: %c, %c, %c, %c, %c, %c, %c, %c, %c, %c\n",rx_buffer[0],rx_buffer[1],rx_buffer[2],rx_buffer[3],rx_buffer[4],rx_buffer[5],rx_buffer[6],rx_buffer[7],rx_buffer[8],rx_buffer[9]);

#if I2C_PRESENT
    i2c_hw_init();
    adxl_init();
#endif

#if RTC_PRESENT
    rtc_init();
    //read backup register
    if(HAL_RTCEx_BKUPRead(&hrtc,RTC_BKP_DR0) != RTC_BACKUP)
    {
        rtc_calendar_config();
    }
#endif

    while(1)
    {
        /* GPIO MODULE */
        /* Read button state continuously */
        /* This is not needed when interrupt is used to commented out */
        if(BUTTON_AS_INTERRUPT==0)
        {
            buttonStatus = HAL_GPIO_ReadPin(BTN_PORT,BTN_PIN);
            HAL_GPIO_WritePin(LED_PORT,LED_PIN,buttonStatus);
        }

        /* UART transmit in polling mode */
        if(UART_MODE==0)
        {
            /* Option1: HAL directly */
            HAL_UART_Transmit(&huart2, (uint8_t *) message, 20, 100);
            /* Option2: use printf */
            printf("Using printf in UART polled mode\n");
            HAL_Delay(20);
        }
#if 0
        if(ADC_CONTINUOUS_CONV==0)
        {
            //Single Conversion
            HAL_ADC_Start(&hadc1);
            //Start adc
            HAL_ADC_PollForConversion(&hadc1, 1);
            //Convert
            sensor_value_polled = pa0_adc_read();
        }
        else if(ADC_CONTINUOUS_CONV==1)
        {
            /* ADC MODULE*/
            sensor_value_conv = pa0_adc_read();
            printf("In the ADC continuos conversion\n");
        }
        else if(ADC_CONTINUOUS_CONV==3)
        {
            /* ADC MODULE*/
            printf("In the ADC dma configuration\n");
        }
        counter++;
        if(SPI_MODE==0) /* polling only */
        {
            printf("SPI in polling mode! \n\r");
            HAL_SPI_TransmitReceive(&hspi1,tx_buffer,rx_buffer,1,100);
        }
#endif

#if I2C_PRESENT
        adxl_read_values(DATA_START_ADDR);
        x = ((DATA_RECORD[1]<<8)|DATA_RECORD[0]);
        y = ((DATA_RECORD[3]<<8)|DATA_RECORD[2]);
        z = ((DATA_RECORD[5]<<8)|DATA_RECORD[4]);

        xg = x * FOUR_G_SCALE_FACT;
        yg = y * FOUR_G_SCALE_FACT;
        zg = z * FOUR_G_SCALE_FACT;
#endif
#if RTC_PRESENT
        //void rtc_calendar_show(uint8_t *showtime, uint8_t *showdate)
        rtc_calendar_show(&time, &date);
#endif
        HAL_Delay(10);
    }
}

/* Callback as per HAL_TIM_IRQHandler */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    /**/
    printf("A second elapsed! \n\r");
}

/* Setup Button as GPIO input */
void pc13_btn_init()
{
    __HAL_RCC_GPIOC_CLK_ENABLE();
    //1. BTN=PC12 as input
    GPIO_InitTypeDef GPIO_InitStruct={
        BTN_PIN,  //Pin
        GPIO_MODE_INPUT,  //Mode
        GPIO_NOPULL,  //Pull
        GPIO_SPEED_FREQ_LOW,  //Speed
        0,  //Alternate
        };
    HAL_GPIO_Init(BTN_PORT, &GPIO_InitStruct);
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc)
{
    //ISR
	sensor_value_int = pa0_adc_read();
    HAL_ADC_Start_IT(&hadc1);
    printf("Inside ADC Callback!\n");
}

void SysTick_Handler(void)
{
    //Increment the clock
    HAL_IncTick();  //Update tick based on clock
}

//20170705-J0680523
